Revit 2024 API
FamilyParameter.IsShared Property
Identifies if the parameter is a shared parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsShared { get; }
Visual Basic
Public ReadOnly Property IsShared As Boolean
	Get
Visual C++
public:
property bool IsShared {
	bool get ();
}
See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace